Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: So when we talk about something affecting or changing an instance, we mean it affects that one particular copy of an object in a room.
zh_cn: 所以当我们谈论影响或改变一个实例的东西时，我们的意思是它会影响一个房间中一个物体的特定副本。

source: So where there is a value with 2 zeros, it'll stay zero.
zh_cn: 所以两个零的值仍然保持零。

source: So while there are 32 bits in an INTEGER, the bits range from 0 to 31, not 1 to 32.
zh_cn: 所以，当一个整型数中有 32 位的时候，它的位域是从 0 到 31 号位，而非 1 到 32 号位。

source: So why is this much worse?
zh_cn: 为什么这样更糟呢？

source: So, 124, 45639.566546456, 0, -45.5 etc... are all examples of real numbers.
zh_cn: 因此，124, 45639.566546456, 0, -45.5 等……所有的这些都是实数。

source: So, the object is the template for the instance, and the instance is what we place in a room to make our game.
zh_cn: 所以，物体是实例的模板，实例是我们用来放置在房间里制作游戏的。

source: So, a balloon would have a low density as it has little mass that occupies a large space, while a lead bar would have a high density as it has a great mass, yet occupies little space.
zh_cn: 所以气球的密度很小，因为它的质量很小，占据很大的空间，而铅棒的密度很高，因为它的质量很大，而且空间很小。

source: So, again, we can make one object the parent of the other, but in this case we also define certain events for the child object.
zh_cn: 因此，我们可以使一个对象成为另一个对象的父对象，但在这种情况下，我们也定义子对象的某些事件。

source: So, every object in your game project can have a parent object, but what does this mean?
zh_cn: 所以，游戏项目中的每个对象都可以有一个父对象，但这是什么意思？

source: So, for example, to create a debug file output you would have:
zh_cn: 例如，需要创建一个调试文件输出，你需要输入：

source: So, how about a multiple by 4?
zh_cn: 那么如果乘以 4 呢？

source: So, if you have two different view ports at two different positions, the total area that they cover defines the size of the game window.
zh_cn: 所以，如果有两个不同的视口在两个不同的位置，覆盖的总面积定义游戏窗口的大小。

source: So, if you select a function, for example, all instances of this function in the current code window will be highlighted too.
zh_cn: 所以，例如，如果你选中一个函数，当前代码窗口所有此函数的实例也都会高亮。

source: So, only when there is a bit in each place will it be kept.
zh_cn: 所以，每个位置都有 1 的地方将保留。

source: So, the above script would be called like this:
zh_cn: 所以，上面的脚本这样使用：

source: So, the code would look something like this:
zh_cn: 因此，代码可以这样写：

source: So, what are events?
zh_cn: 那么，什么是事件？

source: So, what if we wanted the remainder?
zh_cn: 那么，如果我们想要获取余数该怎么办呢？

source: So, what's the faster way to do this?
zh_cn: 所以，我们要如何更快地做到这一点？

source: So, when creating your maps the top left corner tile will always need to be empty in this way.
zh_cn: 所以，在创建地图的时候，左上角的图块总是需要以这种方式变空。

source: So, when two instances collide, their motion is affected by this value, with a high friction causing a larger loss of momentum than a lower value.
zh_cn: 所以当两个实例碰撞时，它们的运动受到这个值的影响，摩擦力会比较低的值导致更大的动量损失。

source: So, when using expressions in your code, ensure you use brackets () to properly control the order of operations.
zh_cn: 因此在代码中使用表达式的时候，请确保合理使用圆括号来控制运算符顺序。

source: So, with that done, we would then have this in the main Draw event:
zh_cn: 接着，那个完成之后，我们需要在主要的Draw 事件中做这些事件：

source: So, you can name the script one thing in the resource tree and name it as another using @function and the IDE will recognise both as alias of the same script resource, but only the @function one will have auto-complete, etc...
zh_cn: 因此，你可以在资源树中把这个脚本命名成一个名字，而在@function中使用另一个名字，IDE会判别两者都是同一脚本资源的别名，但是只有@function所使用的名字具有自动补全等功能……

source: So, you could have something like this in - for example - an Alarm event
zh_cn: 所以，你可能会有这样的东西 - 例如 - 一个Alarm事件

source: So, you would have your "main" canvas, and then your secondary surface canvas elements, which will be assigned using this function to the correct surfaces.
zh_cn: 所以，你会有一个“主”画布，然后是辅助的表面层canvas元素，通过这个函数指定到正确的表面层。

source: Social
zh_cn: 社交（Social）

source: Soft Body Particles
zh_cn: 柔体粒子

source: Solid
zh_cn: 固体

source: Solid instances will automatically be placed back in their previous position when in collision
zh_cn: 在碰撞时，固体实例将自动放回到先前的位置。

source: Some characters will not be visible.
zh_cn: 某些字符将不可见。

source: Some of the fields shown above are optional and if there is one you don't require then simply leave the field blank.
zh_cn: 上图所示的一些字段是可选的，如果不需要某个字段，那么只需要将字段留空即可。

source: Some of these updates will be optional and you can choose not to install them if you don't wish to or think that some of the changes may break a project that you are about to publish.
zh_cn: 有些更新是可选的，如果你不希望安装或者认为某些变动会破坏你要发布的原有工程的话你可以选择不安装它们。

source: Some resources failed to import - see output window for details
zh_cn: 一些资源导入失败 - 详情查看输出面板

source: Sometimes you want a nice graphical effect but don't want the overhead of using an instance or don't need it to do anything other than draw itself.
zh_cn: 有时你需要绘制一个特别好的图形效果，但不希望使用实例以便节省性能资源或者不需要它做出了绘制自己之外的其他任何事情。

source: Sorry, but ${APP_NAME} is only available for 64bit Windows this is a 32bit version of Windows
zh_cn: 抱歉，${APP_NAME} 仅适用于64位Windows，这是32位版本的Windows

source: Sound
zh_cn: 声音

source: Sound Loaded
zh_cn: 声音已载入

source: Sound Mixer
zh_cn: 混音器

source: Sound group
zh_cn: 音频组

source: Sound group mixer
zh_cn: 声音组混合器

source: Sound is an important part of any game, both for adding depoth to the gameplay and giving feedback in the form of sound effects, and for adding atmosphere in the form of music.
zh_cn: 不论是用声音来增加游戏性，还是用声效来提供游戏反馈，以及用音乐来烘托气氛，都说明声音是游戏的重要组成部分。

source: Sound volume
zh_cn: 音量

source: Sound: {0}
zh_cn: 声音：{0}

source: Sounds
zh_cn: 声音

source: Sounds Label Colour
zh_cn: 声音标签颜色

source: Sounds background colour
zh_cn: 声音背景颜色

source: Sounds icon colour
zh_cn: 声音图标颜色

source: Sounds in GameMaker Studio 2 can be uncompressed or compressed, with compressed sounds having additional options on how to deal with them at run time.
zh_cn: GameMaker Studio 2 中的声音可以是压缩或未压缩的，压缩的声音在运行库中有更多的选项来进行处理。

source: Source
zh_cn: Source（源代码）

source: Source Control
zh_cn: 源码控制

source: Source Control (Git)
zh_cn: 源码控制(Git)

source: Source Control (Git) Authentication Failed
zh_cn: 源码控制 (Git) 身份验证失败

source: Source Control (Git) Authentication Settings
zh_cn: 源码控制 (Git) 身份认证设置

source: Source Control (Git) Clone
zh_cn: 源码控制 (Git) 克隆

source: Source Control (Git) Clone Repository
zh_cn: 源码控制(Git) 克隆库

source: Source Control (Git) Commit
zh_cn: 源码控制 (Git) 提交

source: Source Control (Git) Create
zh_cn: 源码控制 (Git) 创建

source: Source Control (Git) Error
zh_cn: 源码控制 (Git) 错误

source: Source Control (Git) External Tool Error
zh_cn: 源码控制 (Git) 外部工具错误

source: Source Control (Git) Import Project
zh_cn: 源码控制 (Git) 导入项目

source: Source Control (Git) Invalid Authentication
zh_cn: 源码控制 (Git) 无效的身份验证

source: Source Control (Git) Invalid Credentials
zh_cn: 源码控制(Git)凭据无效

source: Source Control (Git) Log
zh_cn: 源码控制 (Git) 日志

source: Source Control (Git) No Identity
zh_cn: 源码控制(Git)没有身份标识

source: Source Control (Git) No Repository
zh_cn: 源码控制(Git)中没有存储库

source: Source Control (Git) Pull Error
zh_cn: 源码控制 (Git) 拉取错误

source: Source Control Action '{0}' has an invalid action in the request queue
zh_cn: 源码控制动作'{0}'在请求队列中有一个无效的动作

source: Source Control Action '{0}' has not successfully completed
zh_cn: 源码控制动作'{0}'尚未成功完成

source: Source Control Conflicts
zh_cn: 源码控制冲突

source: Source Control Output
zh_cn: 源码控制输出

source: Source Control Output will go here.
zh_cn: 源码控制输出将出现在这里。

source: Source Control Output would go here, but you are currently using a Trial version.\nPlease upgrade to a paid version to enable the Source Control features!\nVisit https://www.yoyogames.com/get2 to view our pricing.
zh_cn: 源码控制输出将出现在这里，但当前你正在使用试用版。\n请升级到付费版本启用源码控制！\n访问 https://www.yoyogames.com/get2 查看我们的定价。

source: Source Control Window Font Settings
zh_cn: 源码控制窗口字体设置

source: Source Image
zh_cn: 源图像

source: Source Modified
zh_cn: 源（Source）修改

source: Source View
zh_cn: 源码视图

source: Space
zh_cn: 空格键（Space）

source: Span All Columns
zh_cn: 横跨所有列

source: Span All Rows
zh_cn: 横跨所有行

source: Span Entire Grid
zh_cn: 横跨整个网格

source: Spark
zh_cn: 火花

source: Speed
zh_cn: 速度

source: Speed:
zh_cn: 速度：

source: Sphere
zh_cn: 球

source: Spine Agreement
zh_cn: Spine 协议

source: Spine files
zh_cn: Spine文件

source: Spine files are not supported in GameMaker Studio 2 Trial
zh_cn: GameMaker Studio 2 试用版不支持Spine文件

source: Spine files are not supported in the Trial version of GameMaker Studio 2.
zh_cn: GameMaker Studio 2的试用版不支持Spine文件。

source: Spine: json file not found: {0}
zh_cn: Spine：未找到 . json 文件： {0}

source: Spine: unable to find .atlas file for {0}
zh_cn: Spine：无法为{0}找到 .atlas 文件

source: Spine: unable to find texture file: {0}
zh_cn: Spine：无法找到纹理文件： {0}

source: Splash Background Colour
zh_cn: 闪屏背景色

source: Splash Screen
zh_cn: 启动画面

source: Splash Screen Image
zh_cn: 启动画面图像

source: Splash Screen Image 2x
zh_cn: 启动画面 2x

source: Splash background colour
zh_cn: 启动画面背景颜色

source: Splash screen cannot be disabled on 'Creator' platforms
zh_cn: 无法在 “Creator” 平台上禁用启动画面

source: Splash screen image cannot be changed on 'Creator' platforms
zh_cn: 在 'Creator' 平台上无法更改启动画面图像

source: Spline Editor
zh_cn: 样条曲线编辑器

source: Spline Tool
zh_cn: 样条曲线工具（Spline Tool）

source: Split Horizontal
zh_cn: 水平拆分

source: Split Magnify
zh_cn: 分离放大(?)

source: Split Vertical
zh_cn: 垂直拆分

source: Split View Mode
zh_cn: 拆分视图模式

source: Spotlight
zh_cn: 点光源（Spotlight）

source: Sprite
zh_cn: 精灵

source: Sprite Animation
zh_cn: 精灵动画

source: Sprite Editor
zh_cn: 精灵编辑器

source: Sprite Icon
zh_cn: 精灵图标

source: Sprite Label Colour
zh_cn: 精灵标签颜色

source: Sprite Name
zh_cn: 精灵名称

source: Sprite Origin X
zh_cn: 精灵原点 X

source: Sprite Origin Y
zh_cn: 精灵原点 Y

source: Sprite Preview...
zh_cn: 精灵预览...

source: Sprite Selector
zh_cn: 精灵选择器

source: Sprite Strip
zh_cn: 精灵长带图

source: Sprite double click opens image editor
zh_cn: 双击精灵打开图片编辑器

source: Sprite export disabled by tile set(s): {0}
zh_cn: 图块集禁用精灵导出：{0}

source: Sprite is a tile set resource!
zh_cn: 该精灵是一个图块集资源！

source: Sprite will export
zh_cn: 精灵将导出

source: Sprite {0} contains {1} image(s) that failed to load.
zh_cn: 精灵 {0}包含无法加载的{1}图像。

source: Sprite:
zh_cn: 精灵：

source: Sprite: {0}
zh_cn: 精灵： {0}

source: Sprites
zh_cn: 精灵

source: Sprites are generally the visual representations of objects within the games you create.
zh_cn: 精灵通常是您创建的游戏中的物体的视觉表现。

source: Sprites background colour
zh_cn: 精灵背景颜色

source: Sprites can be added to this layer the same way that instances of objects are added to the instance layer, ie: you click on the sprite in the resource tree and then drag it into the room editor workspace.
zh_cn: 您可以将精灵资源添加到该层，就像将物体实例添加到实例层一样，即：单击 资源树中的精灵，然后将其拖入房间编辑器工作区。

source: Sprites icon colour
zh_cn: 精灵图标颜色

source: Square
zh_cn: 正方形

source: Stack
zh_cn: 堆栈

source: Stack Order
zh_cn: 堆叠方向

source: Stack Panel
zh_cn: 层叠面板

source: Stage All
zh_cn: 加载所有

source: Stage Changes
zh_cn: 加载变化

source: Stage Selected
zh_cn: 加载所选

source: Star
zh_cn: 星星

source: Start
zh_cn: 开始

source: Start Awake
zh_cn: 初始唤醒

source: Start Following Path
zh_cn: 开始跟随路径

source: Start Fullscreen
zh_cn: 启动全屏

source: Start Menu Shortcuts
zh_cn: 开始菜单快捷方式

source: Start Page
zh_cn: 起始页

source: Start Profiling
zh_cn: 开始分析

source: Start Timeline
zh_cn: 开始时间轴

source: Start following a path with an instance.
zh_cn: 开始让一个实例跟随路径

source: Start fullscreen
zh_cn: 开始全屏

# Start page failed to load. You can create new projects from the File menu.
source: Start page failed to load.\nYou can create new projects from the File menu.
zh_cn: 起始页加载失败。\n你可以从文件菜单创建新项目。

source: State
zh_cn: 状态

source: Statement2 is the "step" statement that goes to the next loop evaluation.
zh_cn: 表达式2是“步”语句，递进一个值进入下一个循环。

source: Statements should be separated with a ';' symbol to prevent errors with variable declarations and to keep your code clean and tidy, and can consist of variable declarations, expressions and calls to specific functions or scripts.
zh_cn: 语句之间用“;” （英文分号）隔开，以避免变量声明时出错，并且能让你的代码清晰、轻巧，语句的种类包括： 变量声明、表达式、函数调用等。

source: Statistics can only be turned off for paid users
zh_cn: 只有付费用户可以关闭统计

source: Statistics cannot be turned off in GameMaker Studio 2 Trial
zh_cn: 在 GameMaker Studio 2 试用版中无法关闭统计信息

source: Statistics cannot be turned off on 'Creator' platforms
zh_cn: 无法在 'Creator' 平台上关闭统计信息

source: Stats 2013
zh_cn: 2013 统计

source: Stats 2017
zh_cn: 2017 统计

source: Status
zh_cn: 状态

source: Status Delete
zh_cn: 删除状态

source: Status Download
zh_cn: 下载状态

source: Status Running
zh_cn: 运行中状态

source: Status Value
zh_cn: 状态值

source: Status: {0}
zh_cn: 状态：{0}

source: Steam SDK location
zh_cn: Steam SDK 位置

source: Step
zh_cn: 步

source: Step %
zh_cn: 步 %

source: Step Event
zh_cn: 步事件

source: Step event
zh_cn: 步事件

source: Step into a code block or script
zh_cn: 跳入代码块或脚本

source: Step into function call (${debugger_step_into})
zh_cn: 跳入函数调用(${debugger_step_into})

source: Step out of a code block or script
zh_cn: 跳出代码块或脚本

source: Step out of function (${debugger_step_out})
zh_cn: 跳出函数 (${debugger_step_out})

source: Step over a code block or script
zh_cn: 跳过代码块或脚本

source: Step over function call (${debugger_step_over})
zh_cn: 跳过函数调用 (${debugger_step_over})

source: Stereo
zh_cn: 立体声

source: Stop
zh_cn: 停止

source: Stop All Audio
zh_cn: 停止所有音频

source: Stop Audio
zh_cn: 停止播放音频

source: Stop Following Path
zh_cn: 停止跟随路径

source: Stop Profiling
zh_cn: 停止分析

source: Stop all audio.
zh_cn: 停止所有音频。

source: Stop an instance from following a path.
zh_cn: 让一个实例停止跟随路径。

source: Stop playing a sound effect or a music track.
zh_cn: 停止播放一个音效或者音乐音轨。

source: Stop the current running project before running again?
zh_cn: 在再次运行之前停止当前运行的项目？

source: Store Certificate Location
zh_cn: 证书储存位置

source: Store Colour
zh_cn: 储存颜色

source: Store Image
zh_cn: 商店图片

source: Store Logo
zh_cn: 商店Logo

source: Store certificate location
zh_cn: 商店证书位置

source: Straight Lines
zh_cn: 直线

source: Stream
zh_cn: 流

source: Streaming sounds cannot be used in AudioGroups.
zh_cn: 声音流不能在音频组中使用。

source: Stretch
zh_cn: 拉伸

source: Stretch - The image will be stretched to fit the workspace, changing scale depending on the visible docks
zh_cn: 拉伸（Stretch） - 图像将会被拉伸以适配工作区，拉伸尺度取决于可见的停靠栏。

source: Stretch / scale current brush
zh_cn: 拉伸/缩放当前画刷

source: String
zh_cn: 字符串

source: String To Number
zh_cn: 字符串转数字

source: Strings
zh_cn: 字符串

source: Stroke
zh_cn: 轮廓

source: Structure
zh_cn: 结构

source: Studio 2 Assets
zh_cn: Studio 2 资产

source: Style
zh_cn: 样式

source: Style Editor
zh_cn: 样式编辑器

source: Style name:
zh_cn: 样式名称：

source: Sub Menu Entry
zh_cn: 子菜单项

source: Submission Package (/l)
zh_cn: 提交程序包 (/l)

source: Submit
zh_cn: 提交

source: Subtract
zh_cn: 相减

source: Success
zh_cn: 成功

source: Successfully created certificate file: {0}
zh_cn: 成功创建证书文件： {0}

source: Successfully imported project
zh_cn: 成功导入项目

source: Successfully updated Runtime Feeds
zh_cn: 成功更新运行库下载源

source: Support
zh_cn: 支持

source: Support 720p Resolution
zh_cn: 支持720p分辨率

source: Support Forums
zh_cn: 论坛

source: Support Library
zh_cn: 支持库

source: Support WVGA Resolution
zh_cn: 支持 WVGA 分辨率

source: Support WXGA Resolution
zh_cn: 支持 WXGA 分辨率

source: Suppress build and run (just create Xcode project on macOS)
zh_cn: 抑制构建和运行（仅在macOS上创建Xcode项目）

source: Suppress build and run (only create Xcode project on macOS)
zh_cn: 禁止构建和运行（仅在macOS上创建Xcode项目）

source: Surface
zh_cn: 表面

source: Surface {0}
zh_cn: 表面 {0}

source: Surfaces
zh_cn: 表面层

source: Surfaces & Textures
zh_cn: 表面 & 材质

source: Surfaces are volatile meaning that they could be removed from memory at any time due to OS memory management and other things, so here we check to see if our surface exists and if it doesn't we create it and assign it to the view 0.
zh_cn: 表面是 不稳定的，意味着系统内存的管理或其它原因，它们可能会从内存中销毁，所以这里检测表面是否存在，如不存在则创建它，并指定给一个视野。

source: Surfaces are always held in texture memory which means that they can be destroyed from one moment to the next (for example, when a screensaver starts on windows, or when minimised on an Android device), so you should always check that a surface exists before doing anything with it (this includes drawing it to the screen).
zh_cn: 表面一直保存在显存里，这意味着从这一刻到另一刻（比如，电脑启动屏幕时，或者安卓设备最小化时），它可能会被破坏，所以在做与表面图层相关的操作之前，你一直都需要检测是否存在一个表面层（包括向屏幕绘制表面时）。

source: Surfaces take up space in memory and so need to be removed, normally at the end of a room, but it can be done at any time depending on the use you put them to.
zh_cn: 表面图层会占据内存空间，通常需要在房间结束工作时清除它们，可以在任何时间执行这个过程，取决于你使用的方式。

source: Surveys
zh_cn: 调查

source: Swap left and right colours
zh_cn: 左右颜色互换

source: Switch
zh_cn: Switch 异常

source: Switch Package
zh_cn: Switch(NS) 程序包文件

source: Switch To
zh_cn: 切换

source: Switch between selection and editing modes in brush builder page (${room_editor_tools_keyboard_shortcut22})
zh_cn: 画笔生成器页面中选区和编辑模式间切换 (${room_editor_tools_keyboard_shortcut22})

source: Switch between selection and editing modes in brush builder page (CTRL+E)
zh_cn: 画刷生成器页面切换选择或编辑模式（Ctrl+E）

source: Switch nmeta file
zh_cn: Switch(NS) nmeta文件

source: Switch which branch to execute based on input.
zh_cn: 基于输入值来选择执行某一分支的代码。

source: Switching this off will mean that all events will open with the toolbox dock open regardless od any floating windows.
zh_cn: 关闭这个选项意味着所有的事件都会带有一个工具箱栏并无视浮动窗口。

source: Sync from Amazon Fire
zh_cn: 从 Amazon Fire 同步

source: Sync from Android
zh_cn: 从Android同步

source: Synchronise Preferences
zh_cn: 同步偏好设置

source: Syntax Checking delay (ms)
zh_cn: 语法检查延迟 （毫秒）

source: Syntax Error Window Font Settings
zh_cn: 语法错误窗口字体设置

source: Syntax Errors
zh_cn: 语法错误

source: Syntax:
zh_cn: 语法：

source: System
zh_cn: 系统

source: System Frameworks
zh_cn: 系统框架

source: T+LMB: Translate, R+LMB: Rotate, S+LMB: Scale
zh_cn: T+鼠标左键: 平移, R+鼠标左键: 旋转, S+鼠标左键: 缩放

source: TIMELINES
zh_cn: 时间轴函数

source: Tab
zh_cn: 选项卡

source: Tab Control Panel
zh_cn: 选项卡控件面板

source: Tab In
zh_cn: 向内缩进

source: Tab Out
zh_cn: 向外缩进

source: Tab Size
zh_cn: Tab大小

source: Tab drag distance to unmaximise desktop (px)
zh_cn: 非最大化桌面的选项卡拖动距离（px）

source: Tab lines colour
zh_cn: Tab纵线颜色

source: Tab size
zh_cn: 单次Tab大小

source: Table
zh_cn: 表格

source: TableListBox
zh_cn: 列表框

source: Tag Name
zh_cn: 标签名

source: Take 19 + 19 + 19.
zh_cn: 拿 19 + 19 + 19 举例。

source: Take a look at this table:
zh_cn: 请看下面的表格：

source: Take care with what you choose as you cannot change it later and if you do not have the correct password for the certificate file in the sections above you will not be able to update any existing Marketplace assets (nor upload new ones).
zh_cn: 小心你的选择，如果你上面的环节里没有给证书设置正确的密码，你以后再也不能更改，你将不能更新任何外部市场资源（也不能上传新的）。

source: Take this statement where we want to clear bits 1 and 3 again:
zh_cn: 我们想要再次清除位 1 和位 3 的地方使用这个语句：

source: Tangent line colour
zh_cn: 切线颜色

source: Tap
zh_cn: 点按

source: Tapping the notification will start the game on the device and trigger an Asynchronous Push Notification event with a ds_map which can then be parsed to check the payload string and perform whatever action is required.
zh_cn: 点击通知将会启动游戏同时触发 异步推送通知（Asynchronous Push Notification）事件并返回 ds_map ，检查扩展数据的字符串来采取你想要的动作处理这个事件。

source: Target
zh_cn: 目标

source: Target Device IP is required to connect the debugger
zh_cn: 连接调试器需要目标设备IP

source: Target IP
zh_cn: 目标 IP

source: Target Options
zh_cn: 目标选项

source: Target Options:
zh_cn: 目标选项：

source: Target Platform
zh_cn: 目标平台

source: Target SDK
zh_cn: 目标平台 SDK

source: Target Variables
zh_cn: 目标变量

source: Targets
zh_cn: 目标平台

source: Team ID - 10 digit alpha-numeric identifier from your developer.apple.com/#/overview
zh_cn: 团队 ID - developer.apple.com/#/overview 中的10位阿尔法数字标识符

source: Team Identifier
zh_cn: 团队标识符

source: Tell GameMaker Studio 2 not to block on connect.
zh_cn: 告知GameMaker Studio 2不要阻止连接

source: Tell: {0}
zh_cn: 讲述(Tell): {0}

source: Temp
zh_cn: 临时

source: Temp Variable Expansion
zh_cn: 扩增临时变量

source: Temp directory
zh_cn: 临时目录

source: Temp location
zh_cn: 临时位置

source: Terrible
zh_cn: 可怕

source: Test
zh_cn: 测试

source: Test Connection
zh_cn: 测试连接

source: Test Layout
zh_cn: 测试用布局

source: Testing your game can be done by simply pressing the Play button at the top of the IDE, which will launch the game for testing using the specified target.
zh_cn: 只需按下IDE顶部的播放按钮 即可完成游戏测试，该按钮将使用指定的目标平台启动游戏来进行测试。

source: Text
zh_cn: 文本

source: Text Editor Panel
zh_cn: 文本编辑器面板

source: Text Editor Preferences
zh_cn: 文本编辑器偏好设置

source: Text Editors
zh_cn: 文本编辑器

source: Text Input
zh_cn: 文本输入

source: Text Input (MultiLine)
zh_cn: 文本输入(多行)

source: Text Prediction
zh_cn: 文本预测

source: Text Tool
zh_cn: 文本编辑器（Text Tool）

source: Text Viewer
zh_cn: 文本查看器

source: Text colours and style
zh_cn: 文字颜色和样式

source: Text tool
zh_cn: 文本工具

source: Textbox
zh_cn: 文本框

source: Texture
zh_cn: 纹理

source: Texture Groups
zh_cn: 纹理组

source: Texture Page Example
zh_cn: 纹理页范例

source: Texture Page Options
zh_cn: 纹理页选项

source: Texture Page Size
zh_cn: 纹理页大小

source: Texture Pages
zh_cn: 纹理页

source: Texture Settings
zh_cn: 纹理设定

source: Texture Settings:
zh_cn: 纹理设置：

source: Texture Size Not Supported
zh_cn: 纹理大小不支持

source: Texture batches, are basically bundles of data that are sent all at once to the GPU for rendering.
zh_cn: 纹理批次，基本上是一组数据，一次性发送到GPU进行渲染。

source: Texture groups
zh_cn: 纹理组

source: Texture page size
zh_cn: 纹理页大小

source: Texture {0}
zh_cn: 纹理 {0}

source: Textures (sprites and backgrounds) are stored on texture pages, and if you have a lot of image assets in your game, then GameMaker Studio 2 has to swap between texture pages to draw them all, therefore if this value is high (over 20, for example) you really should look into ways to optimise this as it will affect the performance of your game, especially on mobile platforms.
zh_cn: 纹理（精灵和背景）存储在纹理页面上，如果您的游戏中有很多图像资源，那么 GameMaker Studio 2 必须在纹理页面之间进行交换以将其全部绘制，因此如果该值很高（例如超过20），那么您真的需要研究如何优化它，因为该值过高会影响您的游戏性能，特别是在移动端。

source: That "something" can be as simple as adding 2 and 2 to get 4, or as complex as making an enemy run away when their health gets below a certain value.
zh_cn: “某种功能”可以简单到2加2等于4，或者复杂到“当敌人血量低于一定值就逃跑”。

source: That is the list of all the basic events which an object can respond to, although some of those events also have sub events to further refine behaviours.
zh_cn: 这是对象可以响应的所有基本事件的列表，尽管其中一些事件还具有子事件以进一步改进行为。

source: That is when you'd want to create a path resource.
zh_cn: 这时你需要创建一个路径资源。>

source: That means that these mistakes will only become apparent when you actually run or compile your game, and even then it can sometimes be difficult to know exactly what is going wrong.
zh_cn: 这意味着，这些错误只有在您实际运行或编译游戏时才会变得明显，即使这样，有时也难以准确地知道出现的问题是什么。

source: That short code will now spawn a random enemy in the game room, and it uses far less code than an "if / then / else" structure or even a "switch", and as the array is initialized all together in the create event it is MUCH easier to edit and change any of those values as they are not hard-coded into the rest of the object codes.
zh_cn: 上面简短的代码将在游戏房间内产生随机的敌人，这比“if / then / else”结构甚至“switch”结构使用的代码更少。并且由于是统一写在创建事件中，编辑修改起来也更方便。

source: That's fine if you want numbers that are a power of 2, but how do we create more complex numbers?
zh_cn: 数字是 2 的幂的情况都还行，但怎样创建更复杂的数字？

source: That's just the tip of the iceberg as arrays are one of the most fundamental and useful programming tools you can use, and you'd be surprised at the applications they can have!
zh_cn: 这些只是冰山一角，数组是你可以使用的最基础的编程工具之一，他们能应用的地方会让你惊讶。

source: That's right, that's ALL that it takes to align to a 32 pixel boundary.
zh_cn: 对，这就是对齐到 32 像素边界所需要的运算。

source: That's why we have the timeline resource.
zh_cn: 这就是为什么会存在时间轴资源的原因。

source: The "{0}" node is causing an invalid program flow.
zh_cn: 节点 "{0}" 正导致无效的程序流。

source: The "|" operator is a bitwise OR, and this means the above instruction ORs 1 into flags.
zh_cn: "|" 运算符是 位运算的 “或”，意思是上述说明的 “或” 1 并赋值回 flags。
